jekyll/_posts/linux/2012-12-26-dvtm.html
---
layout: post
title: dvtm -- Tiling window management for the console
category: linux
change_frequency: monthly
---


<p>
<b>dvtm</b> 可以方便进行linux终端下的窗口管理。
</p>
<p>
<a href="http://www.brain-dump.org/projects/dvtm/">官网</a>
</p>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">特点</h3>
<div class="outline-text-3" id="text-1">

<ol>
<li>小巧简洁，秉承unix设计哲学.  

<p>
   dvtm只进行窗口的管理，不涉及别的功能，如会话管理等功能。
</p></li>
<li>支持鼠标，可以通过鼠标完成活动窗口的切换，选择等。
</li>
<li>快捷键功能强大，可以进行窗口内的内容选择，复制。
</li>
</ol>



</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">编译安装</h3>
<div class="outline-text-3" id="text-2">


<ol>
<li>下载代码:  



<pre class="src src-sh">git clone git://repo.or.cz/dvtm.git   
</pre>

</li>
<li>编译&amp;安装:  
   确保安装了 <b>ncurses</b> 库（Ubuntu下为 <b>libncurses</b>,Fedora/Redhat下为 <b>ncurses-devel</b> ），dvtm依赖这个库



<pre class="src src-sh"><span style="color: #00cdcd; font-weight: bold;">cd</span> dvtm &amp;&amp; make &amp;&amp; make install   
</pre>

</li>
</ol>

</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">常见问题解决方法</h3>
<div class="outline-text-3" id="text-3">

<ol>
<li>终端颜色问题：  
   如果在dvtm内发现颜色较少，是因为没有设置正确的TERM环境变量.要支持丰富的颜色,

<p>   
   设置 <b>TERM</b> 变量为 <sub>*</sub>-256color<sub>，如</sub>:  
</p>


<pre class="src src-sh"><span style="color: #00cdcd; font-weight: bold;">export</span> <span style="color: #ffd700; font-style: italic;">TERM</span>=xterm-256color   
</pre>

</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">快捷键</h3>
<div class="outline-text-3" id="text-4">

<p>Meta键默认为CTRL-g，可以在启动dvtm的时候-m 指定其他键作为Meta键,如: <b>-m ^w</b>
</p>
<ul>
<li>M-c 新窗口  
</li>
<li>M-j,k 窗口切换  
</li>
<li>M-t 水平铺开窗口  
</li>
<li>M-b 垂直铺开川口  
</li>
<li>M-h,l 窗口放大缩小  
</li>
<li>M-M 鼠标模式切换（鼠标是否可选中文本，鼠标是否可触发窗口切换等）  
</li>
<li>M-m 全屏当前窗口  
</li>
<li>M-. 最小化当前窗口/恢复当前窗口为原来状态（如果当前窗口已经最小化）  
</li>
<li>M-? 调出help  
</li>
</ul>

</div>
</div>
